Repository: abdallahalsoubani-lab/salmaOnboardingMobile
Catalog: SalmaAI/Resources/Localizable.xcstrings
Source language: en
Languages: ar

source: Agreed
ar: تمت الموافقة

# all_pages_valid
source: All data is valid
ar: جميع البيانات صحيحة

# app_subtitle
source: Identity Verification
ar: التحقق من الهوية

source: Approved
ar: تمت الموافقة

source: Arabic
ar: العربية

source: Back Side
ar: الوجه الخلفي

source: Back side missing
ar: الوجه الخلفي ناقص

source: Back to Review
ar: العودة للمراجعة

source: Both sides
ar: الوجهان

# camera_config_error
source: Camera configuration error
ar: حدث خطأ في إعداد الكاميرا

source: Camera not available
ar: الكاميرا غير متاحة

# camera_or_gallery_title
source: Choose Source
ar: اختر المصدر

# camera_permission_explanation
source: The app needs camera access to photograph your ID card and take a selfie
ar: يحتاج التطبيق للوصول إلى الكاميرا لتصوير بطاقة الهوية والتقاط صورة شخصية

# camera_permission_message
source: The app needs camera access
ar: يحتاج التطبيق للوصول إلى الكاميرا

source: Camera permission required
ar: صلاحية الكاميرا مطلوبة

# camera_permission_title
source: Camera Permission
ar: صلاحية الكاميرا

source: Cancel
ar: إلغاء

source: Capture
ar: التقاط

source: Captured
ar: تم الالتقاط

source: Change
ar: تغيير

source: Change Language
ar: تغيير اللغة

source: Check Status
ar: تحديث الحالة

# checkbox_required
source: You must agree to the terms
ar: يجب الموافقة على الشروط

source: Checked
ar: محدد

# checking_status
source: Checking...
ar: جاري التحقق...

source: Choose File
ar: اختيار ملف

source: Choose from Gallery
ar: اختيار من المعرض

source: Choose Language
ar: اختر اللغة

source: Choose Source
ar: اختر المصدر

source: Clear Signature
ar: مسح التوقيع

source: Close camera
ar: إغلاق الكاميرا

# confirm_submit_message
source: Are you sure you want to submit? This cannot be undone
ar: هل أنت متأكد من إرسال طلبك؟ لا يمكن التراجع بعد الإرسال

# confirm_submit_title
source: Confirm Submission
ar: تأكيد الإرسال

source: Continue
ar: متابعة

source: Copy submission ID
ar: نسخ رقم الطلب

# date_must_be_future
source: Date must be in the future
ar: التاريخ يجب أن يكون في المستقبل

# date_must_be_past
source: Date must be in the past
ar: التاريخ يجب أن يكون في الماضي

source: Date of Birth
ar: تاريخ الميلاد

# do_not_close_app
source: Please don't close the app during submission
ar: يرجى عدم إغلاق التطبيق أثناء الإرسال

source: Done
ar: تم

source: Double tap to select
ar: اضغط مرتين للاختيار

source: Double tap to toggle
ar: اضغط مرتين للتبديل

source: Edit
ar: تعديل

source: Empty
ar: فارغ

# encoding_error
source: Error sending data
ar: حدث خطأ في إرسال البيانات

source: English
ar: الإنجليزية

source: Error
ar: خطأ

# errors_count
source: %d errors need fixing
ar: %d أخطاء تحتاج إصلاح

source: Extracted Data
ar: البيانات المستخرجة

# field_required
source: This field is required
ar: هذا الحقل مطلوب

source: fields filled
ar: حقول مكتملة

source: File Selected
ar: تم اختيار الملف

# file_too_large
source: File size exceeds the limit
ar: حجم الملف يتجاوز الحد الأقصى

source: Fix Errors
ar: إصلاح الأخطاء

# fix_errors_before_continue
source: Please fix errors before continuing
ar: يرجى تصحيح الأخطاء قبل المتابعة

# forbidden_error
source: Access denied
ar: غير مصرح بالوصول

source: Front Side
ar: الوجه الأمامي

source: Full Name
ar: الاسم الكامل

source: Gender
ar: الجنس

source: Go to Settings
ar: الذهاب للإعدادات

# has_validation_errors
source: There are errors in your data
ar: يوجد أخطاء في البيانات

# id_capture_back
source: Capture the back of your ID
ar: صوّر الوجه الخلفي للهوية

# id_capture_front
source: Capture the front of your ID
ar: صوّر الوجه الأمامي للهوية

# id_frame_instruction
source: Place your ID inside the frame
ar: ضع الهوية داخل الإطار

# image_blurry
source: Image is blurry. Hold the camera steady
ar: الصورة غير واضحة. ثبّت الكاميرا

# image_quality_checking
source: Checking image quality...
ar: جاري فحص جودة الصورة...

# image_too_bright
source: Image is too bright
ar: الصورة ساطعة جداً

# image_too_dark
source: Image is too dark. Check the lighting
ar: الصورة مظلمة جداً. تأكد من الإضاءة

source: Invalid date
ar: التاريخ غير صحيح

# invalid_email
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

source: Invalid format
ar: القيمة غير صحيحة

source: Invalid selection
ar: الاختيار غير صحيح

# invalid_url_error
source: Invalid URL
ar: رابط غير صالح

# language_will_change
source: App language will be changed
ar: سيتم تغيير لغة التطبيق

# liveness_confidence
source: Confidence: %d%%
ar: نسبة الثقة: %d%%

# liveness_error
source: Liveness check error
ar: حدث خطأ في فحص الحيوية

# liveness_failed
source: Verification failed
ar: فشل التحقق

# liveness_failed_message
source: We couldn't verify you're a real person. Make sure you have good lighting and try again
ar: لم نتمكن من التحقق من أنك شخص حقيقي. تأكد من الإضاءة الجيدة وحاول مرة أخرى

# liveness_instruction
source: We'll verify you're a real person. Follow the on-screen instructions
ar: سيتم فحص أنك شخص حقيقي. اتبع التعليمات على الشاشة

# liveness_passed
source: Verification passed!
ar: تم التحقق بنجاح!

# liveness_preparing
source: Preparing liveness check...
ar: جاري تحضير فحص الحيوية...

# liveness_skip
source: Skip (not recommended)
ar: تخطي (غير موصى به)

source: Loading...
ar: جاري التحميل...

# loading_journey
source: Loading data...
ar: جاري تحميل البيانات...

source: Max
ar: الحد الأقصى

# max_length_error
source: Maximum %d characters
ar: الحد الأقصى %d حرف

# min_length_error
source: Minimum %d characters
ar: الحد الأدنى %d حرف

source: National ID
ar: الرقم الوطني

source: Next
ar: التالي

# no_data_error
source: No data available
ar: لا يوجد بيانات

source: No date selected
ar: لم يتم اختيار تاريخ

# no_internet_error
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# no_journey_available
source: No verification journey available
ar: لا تتوفر رحلة تحقق حالياً

source: Not agreed
ar: لم تتم الموافقة

source: Not captured
ar: لم يتم الالتقاط

# not_captured_required
source: Required — not captured
ar: مطلوب — لم يتم الالتقاط

source: Not filled
ar: لم يتم الإدخال

# not_filled_required
source: Required — not filled
ar: مطلوب — لم يتم الإدخال

# ocr_confidence
source: OCR Accuracy
ar: دقة القراءة

# page_of
source: Page %d of %d
ar: صفحة %d من %d

# parsing_error
source: Error processing data
ar: حدث خطأ في معالجة البيانات

# pending
source: Pending Review
ar: قيد المراجعة

# phone_digits_only
source: Phone number must contain digits only
ar: رقم الهاتف يجب أن يحتوي على أرقام فقط

# phone_too_short
source: Phone number is too short
ar: رقم الهاتف قصير جداً

# photo_captured
source: Captured
ar: تم الالتقاط

# photo_library_permission_explanation
source: The app needs photo library access to select images
ar: يحتاج التطبيق للوصول إلى المعرض لاختيار الصور

source: Photo library permission required
ar: صلاحية المعرض مطلوبة

source: photos captured
ar: صور ملتقطة

source: Previous
ar: السابق

# rate_limited_error
source: Too many requests. Please try again shortly
ar: طلبات كثيرة. حاول بعد قليل

source: Rejected
ar: تم الرفض

source: Remove
ar: حذف

# result_approved_subtitle
source: Your identity has been verified successfully
ar: تم التحقق من هويتك بنجاح

# result_approved_title
source: Your Application is Approved
ar: تمت الموافقة على طلبك

# result_flagged_subtitle
source: Your application needs additional review from our team
ar: طلبك يحتاج مراجعة إضافية من فريقنا

# result_flagged_title
source: Additional Review Needed
ar: الطلب يحتاج مراجعة إضافية

# result_in_review_subtitle
source: Our team is currently reviewing your application
ar: فريقنا يراجع طلبك حالياً

# result_in_review_title
source: Under Review
ar: جاري المراجعة

# result_pending_subtitle
source: Your application is being reviewed by our team. This may take some time
ar: سيتم مراجعة طلبك من قبل فريقنا. قد يستغرق ذلك بعض الوقت

# result_pending_title
source: Application Under Review
ar: طلبك قيد المراجعة

# result_rejected_subtitle
source: We were unable to verify your identity
ar: لم نتمكن من التحقق من هويتك

# result_rejected_title
source: Application Rejected
ar: تم رفض الطلب

source: Retake
ar: إعادة التصوير

source: Retry
ar: إعادة المحاولة

# review_and_submit
source: Review & Submit
ar: مراجعة وإرسال

source: Review Data
ar: مراجعة البيانات

# review_subtitle
source: Verify your data before submitting
ar: تأكد من صحة البيانات قبل الإرسال

source: Select...
ar: اختر...

source: Select date
ar: اختر التاريخ

source: Selfie captured
ar: تم التقاط الصورة الشخصية

# selfie_face_detected
source: Face detected
ar: تم اكتشاف الوجه

# selfie_guide_subtitle
source: Make sure your face is clear and lighting is good
ar: تأكد من وضوح وجهك وأن الإضاءة جيدة

# selfie_guide_title
source: Selfie
ar: صورة شخصية

# selfie_hold_still
source: Hold still...
ar: ثبّت...

# selfie_instruction
source: Place your face inside the frame
ar: ضع وجهك داخل الإطار

# selfie_move_back
source: Move back
ar: ابتعد قليلاً

# selfie_move_closer
source: Move closer
ar: قرّب وجهك

# selfie_no_face
source: No face detected
ar: لم يتم اكتشاف وجه

# selfie_ready
source: Perfect!
ar: ممتاز!

# server_error_generic
source: Server error. Please try again
ar: حدث خطأ في الخادم. حاول مرة أخرى

# session_expired_error
source: Session expired. Please log in again
ar: انتهت الجلسة. يرجى تسجيل الدخول مرة أخرى

source: Sign here
ar: وقّع هنا

# splash_tagline
source: Verify your identity with ease
ar: تحقق من هويتك بسهولة

source: Start
ar: ابدأ

# step_of
source: Step %d of %d
ar: خطوة %d من %d

# step_progress
source: Step %@ of %@
ar: الخطوة %@ من %@

source: Submission failed
ar: فشل إرسال الطلب

source: Submission ID
ar: رقم الطلب

# submission_success
source: Your application was submitted successfully
ar: تم إرسال طلبك بنجاح

source: Submit
ar: إرسال

source: Submitting...
ar: جاري الإرسال...

source: Take Photo
ar: التقاط صورة

# terms_accept
source: I Accept
ar: موافق

source: Terms accepted
ar: تمت الموافقة على الشروط

# terms_must_view_first
source: You must view the terms first
ar: يجب عرض الشروط والأحكام أولاً

# terms_scroll_to_accept
source: Please scroll to the bottom to read all terms
ar: يرجى التمرير للأسفل لقراءة جميع الشروط

# terms_title
source: Terms & Conditions
ar: الشروط والأحكام

# terms_url_error
source: Error loading URL
ar: خطأ في تحميل الرابط

source: Close
ar: إغلاق

source: Tap to capture
ar: اضغط لالتقاط صورة

source: Tap to capture or upload
ar: اضغط لالتقاط صورة أو رفع ملف

# tap_to_choose
source: Tap to choose a file
ar: اضغط لاختيار ملف

# tap_to_choose_file_or_image
source: Tap to choose image or file
ar: اضغط لاختيار صورة أو ملف

# timeout_error
source: Connection timed out. Please try again
ar: انتهت مهلة الاتصال. حاول مرة أخرى

# token_refresh_failed_error
source: Session expired. Please log in again
ar: انتهت الجلسة. يرجى تسجيل الدخول مرة أخرى

# torch_off
source: Flash off
ar: الفلاش معطّل

# torch_on
source: Flash on
ar: الفلاش مفعّل

source: Try Again
ar: إعادة المحاولة

# try_again_later
source: Please try again later
ar: يرجى المحاولة لاحقاً

source: Unchecked
ar: غير محدد

# unsupported_format
source: Unsupported file format
ar: صيغة الملف غير مدعومة

source: Upload File
ar: رفع ملف

source: Use Photo
ar: استخدام الصورة

# extracting_id_data
source: Extracting data...
ar: جاري استخراج البيانات...

source: Extracted ID Data
ar: بيانات الهوية المستخرجة

# confirm_id_data_correct
source: I confirm the above data is correct
ar: أؤكد أن البيانات أعلاه صحيحة

# must_confirm_id_data
source: You must confirm the extracted ID data
ar: يجب تأكيد بيانات الهوية المستخرجة

# ocr_full_name
source: Full Name
ar: الاسم الكامل

# ocr_full_name_en
source: Full Name (English)
ar: الاسم بالإنجليزية

# ocr_national_id
source: National ID
ar: الرقم الوطني

# ocr_date_of_birth
source: Date of Birth
ar: تاريخ الميلاد

# ocr_gender
source: Gender
ar: الجنس

# ocr_male
source: Male
ar: ذكر

# ocr_female
source: Female
ar: أنثى

# ocr_nationality
source: Nationality
ar: الجنسية

# ocr_place_of_birth
source: Place of Birth
ar: مكان الولادة

# ocr_mother_name
source: Mother's Name
ar: اسم الأم

# ocr_expiry_date
source: Expiry Date
ar: تاريخ الانتهاء

# ocr_place_of_residence
source: Place of Residence
ar: مكان الإقامة

# ocr_place_of_issue
source: Place of Issue
ar: مكان الإصدار

# ocr_blood_type
source: Blood Type
ar: فصيلة الدم
